/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "current": {
    "sections": {
      "home-cta-1": {
        "type": "home-cta-1",
        "settings": {
          "cta-1": "Hire us for your event"
        }
      },
      "home-cta-2": {
        "type": "home-cta-2",
        "settings": {
          "cta-2": "Make a bouquet"
        }
      },
      "home-cta-3": {
        "type": "home-cta-3",
        "settings": {
          "cta-3": "Shop bouquets"
        }
      },
      "footer": {
        "type": "footer",
        "settings": {
          "newsletter_title": "Get this week's flowers in your inbox"
        }
      },
      "event-page-title": {
        "type": "event-page-title",
        "settings": {
          "heading": "Come see what we are up to! Scheduled events, pop-up shops, workshops and more are listed in our calendar. We would love to see you soon!"
        }
      },
      "event": {
        "type": "event",
        "blocks": {
          "event_aAyPfT": {
            "type": "event",
            "disabled": true,
            "settings": {
              "title": "Autumn Decorative Broom Making",
              "description": "Join us for a delightful fall workshop where you can craft a decorative boom using fall florals grown and dried at Butter Flower Farm in Yellow Springs, Ohio. This hands-on experience, guided by our friends from Butter Flower Farm, will allow you to create a unique decorative broom perfect to display during the autumn season or all year long!",
              "date_time": "October 19th",
              "price": "Sold Out",
              "button_label": "Get Tickets",
              "button_link": ""
            }
          },
          "event_6cVQyE": {
            "type": "event",
            "settings": {
              "title": "Autumn Wreath Making",
              "description": "Join us for a delightful fall workshop on the farm where you can craft your own custom wreath using beautiful fall florals grown and dried by Butter. This hands-on experience will allow you to create a unique and stunning wreath perfect to display during the autumn season or all year long!",
              "date_time": "September 13th, 2025 from 1-3pm",
              "price": "$70",
              "button_label": "Get Tickets",
              "button_link": "https://app.getoccasion.com/p/n/jTPBHnV6/v5"
            }
          }
        },
        "block_order": [
          "event_aAyPfT",
          "event_6cVQyE"
        ],
        "settings": {}
      },
      "services-text": {
        "type": "services-text",
        "settings": {
          "service1_title": "Weddings",
          "service1_description": "We love love! If you have a dream for your day, we want to help you reach it. We offer a variety of floral packages to suit your needs and your budget, and would love to help make your wedding as dreamy as you deserve.",
          "service2_title": "Events",
          "service2_description": "We don’t just provide flowers and tablescapes for weddings - we love any excuse to make your space gorgeous! We offer floral design for any private event.\n\nWant to host a workshop, a dinner party, or a celebration? We can help! \n\nOur current workshop offerings include fresh & dried bouquet making, fresh & dried wreath making, garland making, and flower crown making. Check out our calendar for currently scheduled workshops or let us know if you’d like to host one! ",
          "service3_title": "Wholesale stems",
          "service3_description": "We offer wholesale stems to florists and floral professionals. Please inquire for pricing and availability – we would love to provide you with our locally grown blooms!\n\nAdditionally, if there are flower varieties you are interested in purchasing that are not currently listed, we may be able to integrate them into our growing plans. Let us know how we can help!"
        }
      },
      "wholesale-page-title": {
        "type": "wholesale-page-title",
        "settings": {
          "heading": "We offer wholesale stems to florists and floral professionals. Please inquire for pricing and availability - we would love to provide you with our locally grown blooms! \n\nAdditionally, if there are flower varieties you are interested in purchasing that are not currently listed, we may be able to integrate them into our growing plans."
        }
      }
    },
    "content_for_index": []
  }
}
